# BuiltInFailures.DividedPathFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedPathFailures Class
BuiltInFailures Class Members See Also
---
Failures related to divided path operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DividedPathFailures
```

Visual Basic
---
```text
Public NotInheritable Class DividedPathFailures
```

Visual C++
---
```text
public ref class DividedPathFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DividedPathFailures
# See Also
BuiltInFailures..::..DividedPathFailures Members
Autodesk.Revit.DB Namespace